int main() {
    char c; /// 每一行，有一個英文
    int d;  /// 有一個數字
    int now = 50; /// 現在的初始速度是 50
    int ans = 0;  /// 預備有「指到對邊」的次數
    while (cin >> c >> d) {
        /// if (c=='L') cout << "在左轉，<< d << "格\n";
        /// if (c=='R') cout << "在右轉，<< d << "格\n";
        if (c=='L') now -= d; /// 往左轉，減掉它
        if (c=='R') now += d; /// 往右轉，加上它
        now = (now % 100 + 100) % 100; /// 取模數 + 100 再取模數，得到 0~99 範圍
        if (now==0) ans++; /// 如果是 0，加到答案
        /// cout << "現在想像車子到哪 "<< now << "\n";
    }
    cout << "答案是:" << ans; /// 每個人，會有自己的答案
}
